"""
==============================
strings:
1)написати прогу яка вибирає зі введеної строки цифри і виводить їх через кому,
наприклад:
    st = 'as 23 fdfdg544' введена строка
    2,3,5,4,4        #вивело в консолі.
==============================
"""

st = 'as 23 fdfdg544'

# 1-solution:
for l in st:
    if l.isdigit():
     print(l, end=',')
print()

# 2-solution:
print(",".join([l for l in st if l.isdigit()]))

"""
###############################
2)написати прогу яка вибирає зі введеної строки числа і виводить їх 
так як вони написані
    наприклад:
      st = 'as 23 fdfdg544 34' #введена строка
      23, 544, 34              #вивело в консолі
##################################################
"""
st = 'as 23 fdfdg544 34'

# solution - 1:
arr = []

for l in st:
    if l.isalpha():
        continue
    arr.append(l)
print(''.join(arr).lstrip())

# solution - 2:
st2 = ''.join([l for l in st if not l.isalpha()]).lstrip()
print(st2)

"""
###############################
1)є строка:
greeting = 'Hello, world'
записати кожний символ як окремий елемент списку і зробити його заглавним:
    ['H', 'E', 'L', 'L', 'O', ',', ' ', 'W', 'O', 'R', 'L', 'D']
###############################
"""
greeting = 'Hello, world'

greeting2 = [l.upper()  for l in greeting]
print(greeting2)

"""
###############################
2) з диапозону від 0-50 записати тільки не парні числа при цьому піднести їх до квадрату
приклад:
[0, 1, 4, 9, 16, 25, 36, 49, 64, 81, 100, 121, 144, 169, 196, 225, 256, 289, 324, ...]
###############################
"""
numArr = [n**2 for n in range(0,50) if n%2]
print(numArr)

"""
###############################
function
- створити функцію яка виводить ліст
- створити функцію яка приймає три числа та виводить та повертає найбільше.
- створити функцію яка приймає будь-яку кількість чисел, повертає найменьше, а виводить найбільше
- створити функцію яка повертає найбільше число з ліста
- створити функцію яка повертає найменьше число з ліста
- створити функцію яка приймає ліст чисел та складає значення елементів ліста та повертає його.
- створити функцію яка приймає ліст чисел та повертає середнє арифметичне його значень.
###############################
"""

# створити функцію яка виводить ліст
def create_list(*args):
    return list(args)


# створити функцію яка приймає три числа та виводить та повертає найбільше.
def max_num(num1:int, num2:int, num3:int) -> int:
    return max(num1, num2, num3)


# створити функцію яка приймає будь-яку кількість чисел, повертає найменьше, а виводить найбільше
from typing import List

def min_max_num(numbers: List[int]) -> int:
    print(max(numbers))
    return min(numbers)


#- створити функцію яка повертає найбільше число з ліста
def max_num_of_list(numbers: List[int]) -> int:
    return max(numbers)


# створити функцію яка повертає найменьше число з ліста
def min_num_of_list(numbers: List[int]) -> int:
    return min(numbers)


# створити функцію яка приймає ліст чисел та складає значення елементів ліста та повертає його.
def sum_of_num_list(numbers: List[int]) -> int:
    return sum(numbers)


# створити функцію яка приймає ліст чисел та повертає середнє арифметичне його значень.
def avg_of_num_list(numbers: List[int]) -> float:
    return sum(numbers)/ len(numbers)

"""
###############################
#1)Дан list:
  list = [22, 3,5,2,8,2,-23, 8,23,5] 
###############################
"""

# знайти мін число
arr = [22,3,5,2,8,2,-23,8,23,5]
min_num = min(arr)
print(min_num)


# видалити усі дублікати
set_of_list = set(arr)
print(set_of_list)

# замінити кожне 4-те значення на 'X'
for i, item in enumerate(arr):
    if (i + 1) % 4 == 0:
        arr[i] = 'X'
print(arr)


"""
###############################
#2) вивести на екран пустий квадрат з "*" сторона якого вказана 
###############################
"""

for x1 in range(12):
    if x1 == 0 or x1 == 11:
        for y1 in range(11):
            print('*', end='')
        print('')
    if 0<x1<11:
        for y1 in range(11):
            if y1 == 0 or y1 == 10:
                print('*', end='')
            else:
                print(' ', end='')
        print('')

"""
###############################
3) вывести табличку множення за допомогою цикла while
###############################
"""

for x in range(1, 10):
    for y in range(1, 10):
        print(('{0:4d}'.format( x * y)), end='')
    print()
